"black-box"_methodology
"conventional"_context-free_morphological_grammar
"glue_language"
"one-time_look_up"_method
'
's
(
(Biber,1993;
(Bikel,
(German-English,
(Karttunen,
(P05-1076.10
(and
(called
(e.g.
(for
(from
(in
(konpyuutaa)
(using
)
-
--
-speaking
0(n)_time
000
1
1.6
100,000
113K
12.5%
126,610
155
160
1983)
1983;
2.284
2004)
20k
23,000
2491
28,449
35.0%
40
5%
6
7.5%
70%_precision
77%
79.1%
80.5%
8000-word
87.5%
89.75%
97%
97.24%
<
AI_problem_solving_techniques
AI_text_generation
APT
ARPA_large-vocabulary_CSR_corpora
AS-closed,
AS-open,
ASR
ASR_output
ATIS_(Air_Travel_Information_System)_domain
A_deterministic_parser
Acoustic_modeling
American Sign Language (ASL) animation
Arabic
Arabic-English
Arabic_information_retrieval
Arabic_word_segmentation_system
Arabic_word_segmenter
Augmented_Transition_Network
Automatic_Speech_Recognition_technology
BLEU
BMM_algorithm
Basque
Bayesian_learning
Bayesian_semi-supervised_Chinese_word_segmentation_model
Bikel's_parser
Boolean_conditions
Boolean_matrix_multiplication_(BMM)
Bulgarian,
CAS
CCLINC_Korean-to-English_translation_system
CCR_formalism
CFG filter
CFG_parser
CFG_parsers
CFG_parsing
CFG_rules
CF_grammars
CMU
CRF
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
CSG
CSR
CTL
Chat-80
Child_Language_Data_Exchange_System_(CHILDES)
Chine_language
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
Chinese_language,
Chinese_newspapers
Chinese_punctuation_marks
Chinese_punctuation_marks,
Chinese_text
Chinese_text_corpora
Chinese_text_input
Chinese_word_segmenter
Chinese_word_sense_disambiguation_model
Chinese_words
CoNLL_2008_shared_task
Coedition
Collins_(2000)_reranker
Combination_methods
Combinatory_Categorial_Grammar_(CCG)_lexicon
Comparator
Comparator_software
Conceptual_Dependency_Theory
Conrath
Construct_Algebra
Cooperative_Model
CriterionSM_Online_Essay_Evaluation_Service
Czech
Czech-English_statistical_machine_translation_system
Czech_WordNet
DARPA_Resource_Management_corpus
DARPA_Spoken_Language_Systems_(SLS)_program
DRT
Definite_Clause_Grammar_techniques
Dialogue_strategies
Dictionary_construction,
Discourse_Representation_Theory
DoPS_system
Dutch
Dutch_Senseval-2_test_data
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
EBMT
ECA
EDOL
EM-algorithm
EM_algorithm
EUROPARL_corpus
English
English text
English,
English,_Arabic_and_Spanish_lexicons
English-Chinese_bitexts
English-Chinese_parallel_corpora
English-French_document_pairs
English-Japanese,
English-Japanese_machine_translation,
English/Chinese_and_English/Japanese_language_pairs
English_Wikipedia,
English_questions
English_sentence_structure
Expectation-Maximization_(EM)_algorithm
F-measure
F-measures
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
FDA
French
French_tenses
GLOSSER
GPSG
GUIs
Gaussian_mixture
Generalized_Alignment
Generalized_Quantifier_approach
German
German_corpus
German_pronouns
German_text_corpora
Graph_unification
Graphical_User_Interface_(GUI)_functions
Grosz-Sidner-style_focus_model
HBG
HBG_model
HDAG_Kernel
HDAGs
HK-closed,
HK-open,
HMM-based_chunk_tagger,
HMM_and_Max-ent_models
HMM_training
HMM_with_Gaussian_mixture_observation_densities
HPSG
HPSG_natural_language_system
HTML_documents
Head_Grammars
Hidden_Markov_Model
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
Hong
Horn_clauses
Human-Machine_Communication
IBM_models
IBM_translation_models
ICICLE_system
IE-enhanced_text_browsers
IE_module
IE_paradigm
ILIMP
IR
IR,
InfoMagnets
Information_Bottleneck
Information_Extraction
Information_extraction_techniques
IntEx_system
Intel_i860_chip
Intra-sentential_quality
Isomorphic Grammars
Italian and English verb subcategorization frames (SCFs)
JAVELIN
JAVELIN_system
JINTACCS_messages
Japanese
Japanese-English_translation,
Japanese_Dictionary_Task_in_SENSEVAL2
Japanese_character_strings
Japanese_language_dictionary
Japanese_natural_language_processing_studies
Japanese_parsers
Japanese_patent_claim_sentences
Japanese_script
Japanese_sentence_analyses
Japanese_sentence_structure
Japanese_text
Japanese_text_processing
Japanese_unknown_words
Japanese_verb_phrases
Jiang
KDS
KL-Conc,
KL-ONE
KL-ONE-like_knowledge_representation_systems
KL-ONE_style_representation
KPSG
Kong
Korean
Korean-English_translation
Korean-to-English_and_a_Japanese-to-English_dictionary
Korean-to-Japanese_dictionary
Korean_and_English_language_pairs
Korean_phonological_knowledge_base_system
Koskenniemi,
Kullback-Leibler_distance,
LCS_representations
LEXSYS
LFG
LFG_semantics
LM
LMs
LR-parser
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
LSA-based_and_the_cooccurrence-based_word_vectors
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
LTAG
LT_(LF)
Languages
Large-scale_natural_language_generation
Lexical-Functional_Grammars_(LFG)
Log-linear_models
Longman_Dictionary_of_Contemporary_English
Lucy
M
MBR_decoders
MBR_decoding
MORphological_PArser_MORPA
MSR- closed
MSR-open
MT
MT,
MT-based_paraphrasing_technique
MT_evaluation
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
MT_evaluation_techniques
MT_output
MT_system
MT_systems
MUC-6 and MUC-7 English NE tasks
MWEs
MWEs_database
Machine_Translation
Machine_Translation_(MT)_systems
Machine_transliteration/back-transliteration
Markov_model
MeSH
MeSH_relations
Memo-functions
Message_Understanding_Conferences
Metagrammatical_formalisms
Mimo,
Mimo_formalism
Minimum_Bayes-Risk_(MBR)_decoding
Minimum_Bayes-Risk_framework
NL
NLP
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
NLP_system
NLP_tasks
NL_evaluations
NP
NP-_and_non-NP-antecedents
NP-complete
Nagao,1993;
Name List,
Named_Entity_(NE)_tagging
Named_Entity_task
Natural_Language_Processing_(NLP)_applications
Natural_Language_Processing_(NLP)_system
Nigam
Node-based_inference
Node-based_inference_rules
Noun Classifier Associations (NCA)
O(n6)_time
OCR
OT
P-CFG
PAKTUS
PCFG-LA
PCFG-LA model
PER
PK-closed,
PK-open,
POS tags in English,
POS_learning
Paramax_spoken_language_understanding_system
Path-based_inference
Path-based_inference_rules
Penn_Treebank_Corpus
Penn_Treebank_data
Penn_WSJ
Penn_discourse_annotation
Plume
Plume's_approach_to_parsing
PoS-tag_feature_function
Polish
Polymorphemic_stems
Prague_Dependency_Treebank
Praguian_dependency-based_approach
Presentor
Procedural_Systemic_Grammar
Prolog
PropBank
Proposition_Bank_data
Q/A
QA_system
RAREAS
RCL_parser
RCL_parsers
RINA,
Recognition_of_proper_nouns
SCFs
SCFs_distributions
SI recognition,
SI_corpus
SL
SLS_systems
SMT
SMT_models
SMT_research_community
SRHs
SRI_toolkit
SSTC
STRAND
SUN4
SVM
SVM_learning
SVMs
Semantic_theories
Sentence_boundary_detection
Similarity-driven_Transfer_System_(SimTran),
Situation_Theory
Slavic language
Smadja,1993)
Source_and_Target_languages
Southern_Min_Chinese
Spelling-checkers
Spoken_Language_Systems_(SLS)
Statistical_Machine_Translation_(SMT)
Syllogistic_reasoning_with_dispositions
Systemic_grammar
TAG
TAGs
TAP-XL_Automated_Analyst's_Assistant
TIPSTER_Architecture_specification
TIPSTER_applications
TL
TRDR_score
TV_shows
Taiwan_Child_Language_Corpus
Task-based_evaluation
Temporal_Expression_Anchoror_(TEA),
Term_similarities
Thai_key_prediction
TiMBL,
Topic_Detection_and_Tracking_tasks
Topic_signatures
Translations
Tree_Adjoining_Grammars
Turkish
Turkish_dependency_treebank
Turkish_word_structures
Unification_Categorial_Grammar_(UCG)
VME_bus
VSM_model
Verbmobil_task
WH-questions
WSD_models
WSD_programs
WSD_task
WWER
Wall_Street_Journal_articles
Wall_Street_Journal_treebank
Web
Wizard_of_Oz_technique
WordNet
WordNet,
WordNet-based_measures,
Word_Sketch_Engine,
Words
XTAG
Xerox_PARC
[ANA]
[Zernik88],
a
abduction
abductive_inference
ability
able
about
abstract
abstract_flat_syntactic_representations,_LFG_f-structures,
abstract_moves
abstraction
abstractions
abstracts
access
according
account
accuracies
accuracy
accuracy_rate
accurate
achieve
achieved
achieves
achieving
acquire
acquired
acquiring_adjectival_subcategorization_frames
acquisition_of_word-semantic_information
ad
adaptation
adapted
adaptive_learning_procedure
added
adding
addition
additional
address
addressed
addressee_identification
adequate
adjacent
adopt
adopts
advances
advantage
advantages
advertisements
affix_removal
after
against
agenda-based_scheduling_parser
agglutinating_free_word_order_language
agglutinative_language
agglutinative_languages
agree
agreement
aid
aids
aims
al.
algorithm
algorithm_for_translation_lexicon_acquisition_(SABLE),
algorithms
aligned_bilingual_corpus
alignment
alignment_adaptation_approach
alignment_errors
all
alleviate
allow
allowing
allows
along
alphabets
also
alternative
alternative_markers
ambiguities
ambiguity
ambiguity_packing_and_stochastic_disambiguation_techniques
ambiguity_representations
ambiguity_resolution
ambiguous
ambiguous wordform,
ambiguous_word
among
amount
amounts
an
analogies
analysed
analyses
analyses_for_large_treebank_grammars
analysis
analysis_mechanism
analyst
analytical_components
analytical_inverses
analyze
anaphora
anaphora_references
anaphoric_component
and
annotate
annotating_scheme
annotation
annotation_scheme
another
answer
answer/question_terms
answer_candidates
answer_expressions
answer_extraction
answer_resolution_algorithm
answering_agents
answers
antecedence_recovery
antonymous_adjectives
any
apartment
appear
appears
application
applications
applied
apply
applying
approach
approaches
appropriate
approximation
approximation_error
arbitrarily
arbitrary
arbitrary,
architectural_modules
architecture
are
areas
argued
argument_frames
argument_structures
argumentation_system
arguments
around
articles
as
assigning
assignments
associated
associative_relationship
associative_relationships_between_verb_phrases
associative_similarity
asymmetric,_or_directional,_relations
at
attain
attentional_focus
attentional_state
attentional_structure_in_discourse
attractive
attribute_sequences
attributes
audio_and_scanned_image_data
augment
augmented
augmented_Friedman_-_Warren_algorithm
author
automated_evaluation_techniques,
automated_interpretation
automatic
automatic_Q/A
automatic_abstracting_systems,
automatic_alignments
automatic_discovery_of_text
automatic_estimation_method
automatic_evaluation
automatic_evaluation_measures
automatic_evaluations
automatic_extraction
automatic_language_identification
automatic_metrics
automatic_segmentation
automatically
automatically,
automatically_acquired_parallel_corpus
automaton
auxiliary
available
average
averaging
aware
backwards_transliterations
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
bag-of-words_methods
bare_slice_disambiguation
base_parser,
based
baseline
baseline_system
basic
basis
be
beam-search_decoder
bearing
because
become
been
begin
behavioral_patterns
being
benchmark_system
benefit
best
best-path,_bottom-up,_deterministic_parser
best-reported
better
between
beyond
biases
bibliographic
bigram_back-off_language_models
bilingual_corpora
bilingual_dependency_relations
bilingual_dictionaries
bilingual_dictionary_coverage
bilingual_material
bilingual_parallel_corpus
binary_relational_calculus_notation
binary_relations
biological_entities
biomedical_and_linguistic_ontologies
biomedical_text
bit-vector-based_CKY-style_parser
bit-vector_operations
blackboard-like_architecture
block_reordering
block_selection_criteria
blocks
blog_posts
board
body
boosting_approach
bootstrap
bootstrapping_approach
both
bottom-up_pattern-matching_parser
broad_coverage_lexicon
build
building
built
but
by
calculus
called
can
candidate
candidate_parses
candidates
cannot
capability
capitalization
capture
captured
captures
carried
carry
case-based_MT_(CBMT)
case-based_reasoning
categories
categorization_task,
category
category_labels
ccg_parsing
ccg_supertagging
centering approach
cepstrum-based_features
certain
certainty_conditions
certification
challenges
character
character-_and_word-segmented_data
character_and_word_error_rate
character_bigrams
character_types
characterize
characterized
characters-based_Chinese_collocation_system
chart-based_phrase_structure_parsing
check
children
choose
chunking
chunking_performance
chunking_results
chunks_of_words
circuit_specifications
citations,
citing
claimed
class
class-oriented_framework
class_of_languages
classification-based_representation_techniques
classification_method
classified
classifier
classifier_assignment
classifier_word
classifiers
clauses
closely
clues
clustering_and_filtering_processes
clustering_methods
clusters
co-occurrence_distribution
co-occurrence_patterns
co-occurrence_similarities
coarse-grained_concepts,
coarse-level_clustering
cognitive_psychology
cognitively_well-motivated_interfaces
cognito-pragmatic
coherence
coherence_assessment
coherent
coherent_text
cohesive text
collected
collecting
collection_of_dialog_motivators
collection_of_relations_and_operations
collocations
combination_methods
combine
combined
combines
combining
comes
comma_checker
common
common_text_processing_modules
commonly
commonsense_reasoning
communicative_signals
compact
compactly
comparable
comparable,_non-parallel_corpora
comparative
compare
compared
comparison
compete
competitive
complete
completeness
complex
complex_sentences
complicated
component
components
compositional_approaches,
compositional_interpretation
compositional_syntax_rules
compositionality
compounds
comprehensive
compression_ratio
comprising
computational
computational_complexity
computational_lexicon
computational_linguistics
computational_methods
computational_model
computational_problems
computational_semantic_analyses
computational_theory
computationally
computed
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
computer_text_generation_system
concept
concept-concept_matrix
concept-distance_measures
concepts
conceptual
conceptual_level
conceptual_operations
conceptual_system
conceptually
concrete_noun
conditional_log-linear_model,
conditional_loglinear_models
conditioning variables
confidence
confidence_measures
configurable
conjunction
conjuncts
connectionist_(neural)_network
connectionist_component
connectivity
consequences
consider
considered
consist
consistency_problem
consisting
consists
constituent_parts
constituent_structure_trees
constitute
constraining
constraint
constraint_system
construct
constructed
constructing
construction
construction-specific_approach
constructions
constructs
contain
containing
contains
content-independent_formalism
content_words
context
context-free_chart_parsing
context-free_grammars
context-free_languages
context-free_parsing
context-free_phrase-structure_grammar
context-free_phrase_structure_rules
context-sensitive,_phrase_structure_grammar
context_free_languages
contexts
contextual_similarity
continuous_density_HMM
continuous_speech_recognition_(CSR)_techniques
contributes
control
control_structure
conventional_statistical_methods
conventionally
converge
conversation_analysis
conversation_transcripts
convey
convolution_kernel
cooccurrence
cooccurrence_patterns
cooccurrence_statistics
cooperative
cooperative_responses
coordinate_phrases
coordinations
core
core_modules
corpora
corpus
corpus-based sample
corpus-based_approach
corpus-based_method
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
corpus_data
corpus_text
correctness
correlate
correlation_measure
correspond
corresponding
could
create
created
creation
credibility_indicators
critical
critical_discussion
cross-entropy
cross-lingual_comparisons
crossed_serial_dependencies
crossing_liaisons
cue_phrases
culling
current
currently
customized
data
data_objects
data_representation
data_representation_choice
data_representations
data_retrieval
database
database_query_application
databases
deadline
deaf
deal
deals
decision-making
decision-tree_approach
decision-tree_classifier
decision_list
decision_strategies
decision_tree
decision_tree_architecture
decision_tree_based_approach
decision_tree_learning
decision_trees
declarative
declarative and imperative utterances,
declarative_formalism
declarative_languages
decoding
decoding_strategy
dedicated
deduced
deductive_approach
deep_processing
defeasibility
defeasible_reasoning
defeat_rules
define
defined
definite_clause_grammars
definition_sentences
definitions
delimiters
demonstrated
demonstrative_expressions
demonstrative_forms_and_functions
denotational_semantics
departure
depend
dependencies
dependency-based_grammar_model
dependency_parsing
dependency_relation_paths
dependency_relations
dependency_structure
dependency_structures
dependency_tree
depending
derivation
derivational_history
derivations
derived
derived_string
derived_strings
derived_words
describe
described
described,
describes
describing
description
descriptions
designed
despite
detect
determination
determined
determiners
determining
deterministic_finite_automaton
deterministic_grammar
deterministic_parsers
developed
developed,
developing
development
deviates
devised
dialog_management_system
dialog_manager,
dialog_model
dialog_motivators
dialog_schemata
dialog_systems
dialogue
dialogue_acquisition_and_tracking_algorithm
dialogue_corpora
dialogue_interaction
dialogue_system
dialogue_systems
dialogue_translation_system
dictionaries
dictionaries_of_word_forms
dictionary
dictionary-based_word_vectors
dictionary_word_sense_definitions
did
differ
different
different-quality_references
difficult
digital_learning
dimensionalized_space
direct
direct_orthographical_mapping_(DOM)
direction-giving_task
directionality
directly
disambiguate
disambiguation_algorithms
disambiguation_tool
discontinuous_constituents
discourse
discourse segment,
discourse-level construct
discourse-relevant_purposes
discourse_connectives
discourse_constraint
discourse_context
discourse_copying_algorithm
discourse_level
discourse_processing
discourse_relations
discourse_segmentation
discourse_structure
discourse_task
discourse_understanding_process
discourses
discovered
discovering_parallel_sentences
discriminative_log-linear_models
discriminative_training_criterion
discursive_usage
discusses
disjunctions
disjunctive_feature_structures
display_of_graphical_information
distance
distance values
distinct
distinguish
distributed_message-passing_infrastructure
distribution
distributional_approximation
distributional_concept-distance_measures
distributional_hypothesis
distributional_word_feature_vectors
distributions
do
document-oriented_applications
documents
documents_with_signal_content
does
domain
domain-independent
domain-independent_capabilities
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
domain-specific_(in-domain)_word_alignment
domain-specific_semantic_information
domain-specific_translation_lexicons
domain-specific_word_alignment
domain_dependence
domain_entities
domain_independent_features
domain_independent_model
domain_knowledge
domain_specific_terms
domains
domains:
done
dramatically
drawn
draws
duration_model
during
dynamic_combiner
dynamic_language_model_combination
dynamic_programming
dynamic_programming_(DP)
each
easy
easy-to-implement
edges
edit_distance
editor
educational_tool,
effective
effectively
effectiveness
efficiency
efficient
efficient,
efficiently
either
elaborated
electronic_discussions
electronic_newsgroup_discussions
element
elementary_structures
ellipsis
ellipsis_resolution
email-threads
email_communication
email_conversation
embedded
embodied
embodied_conversational_agent
emoticons
empirical
employing
encodes
encyclopedia,
enhance
enhances
enough
enriching
ensemble_learning_approach
entailment_acquisition
entailment_relations
entirely
entirely_data-driven_model_selection_procedure
entities
entity-based_representation
entity-oriented_parser
entropy
enumeration
epistemological_level
equivalence
equivalences,
equivalent
error
error-correction_rules
error_correction
error_correction_mechanisms
error_rate
errors
essays
essential
estimate
estimated
estimations
et
etc.,
evaluate
evaluated
evaluating
evaluation
evaluation_measure
evaluation_measures
evaluation_method
evaluation_metrics
evaluation_of_Natural_Language_systems
even
event
event_map
event_structure
event_terms
events
every
evidence
exact_match_accuracy
exactly
example
examples
exceeds
excluded
exhibit
existence
existing
existing_grammar
exotic,
expanded
expectation-maximization_(EM)_based_word-clustering_algorithm,
expectations
expectations,
expected
expected_(grammatical)_sentences
expensive
experimental
experimental_evaluation
experiments:
expert_systems
explanation_generation
explanation_system
expletive_occurrences
explicit
explicitly
exploit
exploits
exploratory_corpus_analysis
explore
exponential
express
expressed
expression
extended
extended_domain_of_locality_(EDOL)
extensive
extensively
extract
extracted
extracted_field
extracted_fields
extracting_subcategorization_frames
extraction
extraction_system
extraction_tool
extracts
f-structures
faced
facilitate
fake
fast,
feature-based relation extraction
feature-based_relation_extraction
feature-based_word_grammar
feature_functions
feature_selection_methods
feature_structure-directed_generation,
feature_structure_unification
feature_structures
feature_vectors
feature_weighting_and_selection_function
features
feedback
few
fewer
field_structured_extraction_tasks,
field_structured_text
filled
filter
final
find
finding
fine-grained_grammatical_categories
finite
finite-state_approximation
finite-state_methods
finite-state_models
firmly
first
fits
flexibilities
flexible,
flexible_parser
flexible_parsing
focus
focus_of_attention
focussed
following
for
forecasts
formal
formal_analysis
formal_definition
formal_intersections_of_FSAs
formal_language
formalising
formalism
formalisms
formalization
format
formatted_weather_data
formulas
formulate
formulated
forward_pass,
found
four
four-participants_face-to-face_meetings
fourteen
fragments
frames
framework
free-content
free_indexation
free_word_order
frequency_classes
frequency_counts
frequency_profiles
from
full_NPs
full_parsing
full_scale_two-level_morphological_description
fully-connected_first-order_statistical_class_grammar
function_words
functional_structure
functions
fundamental
fundamentally
further
fuzzy_quantifier
fuzzy_quantifiers
fuzzy_syllogism
gain
gained
gaps
gave
gene_and_protein_interactions
general
general-purpose_NLP_components
general_and_domain_corpora
general_domains
general_linguistic_knowledge
generalizable_semantic_principles
generalized_metaphor
generalized_metaphor_mappings
generalized_translation_knowledge
generate
generate)
generated
generates
generation
generation_problem
generation_system
generative_history-based_latent_variable_model
generative_model
generative_model,
generative_probabilistic_model
generator
generators
generic
genetic_search
genre
genre-specific_regularities
genres
given
gives
global_meaning
goal
gold-standard_parse_trees
good
good,
graceful
grammar
grammar_checker
grammar_coverage_problems
grammar_formalisms
grammar_sensu_stricto
grammars
grammatical_formalisms
grammatical_frameworks
grammatical_gender
grammatical_number
grammatical_relations
grammatical_sentences
grammaticality
grammatically_correct_input
graph
graph_transformations
graphic_interpretation_system
graphical_model
graphics_displays
greatly
groupings
grs
guide
habituality
hand-crafted_template-based_or_rule-based_approaches
handle
handles
handling
hard decisions
hard_problems
hardness
hardware_designs
has
have
help
helpful
helping
heuristic_learning
heuristic_principles
heuristic_rules
hidden Markov models (HMM),
hidden-variable assignments:
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
hidden_variables
hierarchical_(or_other_types_of)_relations
hierarchical_lexicon
hierarchical_relations
hierarchically-structured_terminology
hierarchies
hierarchy
high
high-accuracy_word-level_alignment_models
high-quality_data
higher
highly
highly_inflective_languages
histogram
hoc
honorifics
house,
how
hubs
human
human language learners,
human-machine_interactions
human_cognition
human_data
human_judgment
human_plausible_reasoning
human_transcription
human_transcriptions
human_understanding_of_natural_language
hybrid_generator,
hypotheses_graph
hypothesis
hypothesize
i/l:::'=--~--
identification_of_non-local_depenencies
identification_of_paraphrases
identify
identifying
ideograms
idiosyncracies
idiosyncrasies
ill-formed_input
illustrated
impacts
implementation
implemented
implements
implicit
implicitly
important
improve
improved
improvement
improvements
improves
improving
in
in-domain_corpus
in-domain_word_alignment
included
includes
including
incorporate
incorporated
incorporates
incorporating
increased
incremental_description_refinement
incremental_probabilistic_parser
incrementally
indeed
independent_classifiers
independently
independently trained models
indexing
indicators
indices
indirectly
individual
induced
induced_model
industry_watch
inescapable
inevitable
inference
inference_types
inferential component
inferred
inflected_forms
inflection
inflow
influence
information
information workers
information_extraction_system
information_extraction_tasks
information_extraction_techniques
information_flow
information_redundancy
information_retrieval_techniques
information_source
inherent
inheritance
initially
input
input_dataset
input_word
instance
instance,
instead
integral
integrate
integrates
integrating
integration
intelligent_mobile_agents
intelligibility
intense
intentional_structure
intentions
interaction
interactions
interactive_problem_solving
interactive_question-answering_(Q/A)_system
interconnected
interface
interfaces
interlingua
interlingual_approach
internal_and_contextual_information
interpolation_methods,
interpret
interpretation
interpretation_and_generation_of_natural_language
interrogatives
into
intractability
introduce
introduced
introduction
intuitive
involve
involves
irrelevant
is
it
it,
its
itself
joint_model
judicious
keep
kernel_functions
keywords
kind
kinds
knowledge
knowledge-based_and_random_selection_procedures
knowledge-based_generation_systems
knowledge-based_mechanisms
knowledge_engineering
knowledge_sources
known
known_deterministic_parser
labeled
labeled_data
labeled_directed_graph
labelled_bracket_F-score
labels
laboratory_study
lack
language
language processing pipeline
language-independent_system
language_(L0)
language_acquisition
language_functionalities
language_identification
language_independent_modules
language_learning_model
language_model
language_modeling
language_modeling_tasks
language_pairs
language_processing_systems
language_processing_tasks
language_tutoring_application
languages
large
large-scale
large-scale_knowledge_base
large-vocabulary_CSR,
large-vocabulary_speech_recognition
large_Czech_MWE_database
large_corpora
largely
larger
latent_variable
latent_variable_model
lattice-based_approach
laws
layout
leading
learn
learned
learners
learning_algorithm
left_corner_parsing_algorithm
legal_terminology
lemma-based_approach
lemma-based_model
lend
less
level
levels
lexical category ambiguity
lexical,_syntactic,_semantic,_and_structural_information
lexical_affinity
lexical_and_syntactic_features
lexical_and_syntactical_variation
lexical_approaches
lexical_conceptual_structure_(LCS)_representations
lexical_coverage
lexical_database
lexical_hierarchy
lexical_items
lexical_methods
lexical_similarity
lexical_substitutions
lexical_translations
lexical_unknown,
lexical_weighting
lexicalised
lexicalized_grammar
lexicalized_structures
lexically-induced_relations
lexico-syntactic_knowledge
lexicologists
lexicon
lexicons
like
likelihood
limitations
limited
limited-domain_spoken-language_task
limits
linear-chain_conditional_random_field_(CRF)
linear_logic
linguistic information,
linguistic rules
linguistic_PoS_tagger_and_chunker
linguistic_and_non-linguistic_knowledge
linguistic_annotation
linguistic_concepts
linguistic_domain
linguistic_expressiveness
linguistic_information
linguistic_introspection
linguistic_objects
linguistic_parser/generator
linguistic_phenomena
linguistic_processing
linguistic_representation
linguistic_resources
linguistic_structure
linguistic_structures
linguistic_theory
linguistically
listener
little
live_closed_captions
local_structure
localized_phrase-based_prediction_model
log(d)_overheads
log-linear and linear interpolation,
log-linear_(maximum-entropy)_models
log-linear_block_bigram_model
log-linear_combination
log-linear_models
logic
logic,
logical_form_language
logical_formulas
logical_model
logical_well-formedness_conditions
loss_functions
lower
lower_bound_estimation
machine
machine translation (MT) systems
machine-readable_dictionaries_(MRD's)
machine-readable_resources
machine_learning_approach
machine_learning_techniques
machine_translation
machine_translation_(MT)_evaluation
machine_translation_output
machine_translation_outputs
machine_translation_pipeline
machine_translation_system
machine_translation_task
machine_transliteration/backtransliteration
macro-average_F1
macro-average_F1_performance
made
magnitude
mainly
maintains
make
makes
making
management_of_uncertainty
manner
manual_feature_selection
manual_transcription
manually_segmented_Arabic_corpus
manually_segmented_corpus
manually_sense-tagged_data
many
mapped
mapping_score
mappings
marine
marked
marks
mathematical_expressions
maximization
maximum-entropy_model
maximum_entropy_word_alignment_algorithm
maximum_likelihood_method
may
meaning
meaning-entailing_substitutability
meanings
means
measure
medium-length
meet
members
memory-based_learning_chunker
memory-based_system
met
meta-inference_types
metaphors
method
method_of_analyzing_metaphors
method_to_automatically_acquire_paraphrases
methodology
methods
metric
military_and_civilian_systems
million
minimizes
minor
mismatch_resolution_scheme
missing_words
mixture
mobile_military_command_and_control
model
model_checking
model_design
model_of_grammatical_processing
model_parameters
model_theoretic_interpretation
modeling
models
modification_probabilities
modified
modular
modular_architecture
module
modules
moment
monolingual dependency parse
monolingual_and_bilingual_information
monolingual_parallel_corpora
more
morpheme_sequence
morpho-syntactic_and_semantic_characteristics
morphological_analysis
morphological_analysis_problem
morphological_analyzer
morphological_and_syntactic_information
morphological_component
morphological_constructions
morphology
most
motivated
move-tagged_abstracts
much
much-studied
multi-component_architecture
multi-pathway_MT_architecture_design
multi-strategy_and_multi-source_approach_to_question_answering
multi-strategy_approach
multi-strategy_framework
multi-tagging_approach
multidimensional_chart_parser
multilingual,_multimedia_data
multilingual_TIPSTER_user_interfaces
multilingual_input
multilingual_speech_and_language_applications
multilingually_aligned_wordnets
multimodal_parsing_and_understanding
multiple
multiple_and_nested_interactions
multiple_complementation_patterns
multiple_parsing_strategies,
multisentential and multi-paragraph explanations
must
mutual_information
n-ary_relations
n-best_speech/language_integration_architecture
n-gram_statistics
n-gram_transliteration_model_(n-gram_TM),
named entities
named_entity_(NE)_recognition_(NER)_system
namely
names
naming_conventions
natural language interfaces
natural_language
natural_language_applications
natural_language_environment
natural_language_generation
natural_language_generation_community
natural_language_interface
natural_language_interfaces
natural_language_interpretation
natural_language_processing
natural_language_processing,
natural_language_processing_(NLP)_systems
natural_language_processing_systems
natural_language_system
natural_language_text
natural_language_understanding
natural_languages
natural_sublanguages
naturally
nature
neat_texts
necessary
need
needed
needs
never
new
new_domain
new_event_detection
new_sublanguage
news_articles
newspaper text,
newspaper texts
newspaper_corpus
newswire_texts
node-based_inference
node_structures
nodes
nominal_compounds
nominal_constituents
nominals
non-English_(Arabic)_stemmer
non-configurational_languages
non-contiguous_phrases
non-literal_aspects_of_communication
non-terminal_symbol
non-terminals
normal
not
noun
noun_WSD_problems
noun_phrase_chunks
nouns
novel
number
numbers
numerous
objects
observed
obtain
obtained
occur
occurring
of
offer
offers
official_rankings
often
on
on-line_encyclopedias_and_dictionaries
one
only
onto
open-domain_question_answering
operate
operates
operational_foreign_language_tutoring
operational_semantics
opposed
optimum_iteration_number
or
oral_communication
order
ordinary
oriented
original
originally
other
our
out
out-of-domain_corpus
outperform
outperforms
output
outputs
over
overall
overcome
overt_case_markers
own
packed
pair
pairs
paper
parallel_concordances
parallel_corpora
parallel_corpus
parallel_data
parallel_structures
paraphrase
paraphrase_class
paraphrase_classification_accuracy
paraphrase_examples
paraphrases
paraphrasing
paraphrasing_method
parse
parse trees
parse-trees
parse_forest
parse_forest_representation
parse_record
parse_reduction
parse_tree
parse_trees
parsed
parsed_corpus
parser
parser_MDCC
parser_for_non-configurational_languages
parsing
parsing-based_NE_rules
parsing_algorithm
parsing_data
parsing_method
parsing_process
parsing_strategies
parsing_technique
part
part-of-speech_annotation
part-of-speech_tagging,
part_of_speech_(pos)_tagging
part_of_speech_information
partial_theories
participated
particular
particularly
parts of speech
passed
passives,
patchy
path_values
pattern
patterns
per
performance
performance_improvement
performed
performing
performs
permit
permits
permitted
personal_computers
personal_names,
pharmaceutical news archive
phone-string_classifier
phone_n-gram_model
phonetic_recognition
phonological_system
phrasal_patterns
phrase
phrase translations
phrase-based_models
phrase-based_statistical_machine_translation_method,
phrase-based_unigram_model
phrase_boundary_heuristics
phrase_chunking
phrase_structure_grammar
phrase_translations
phrases
pieces
pipelined_NLG_architecture,
pivot
place
placement
planning-based_architecture
plays
polarity-tagged_corpus
polarization
polynomial_time
polynomial_time_solution
polysemous_word
polysemy
pooling
portability
ported
portion
pos_tag_ambiguity
positive_and_negative_definition_examples
positive_feature_vectors
possible
possible,
post-processing
potential
powerful
practical
practically_unsupervised_learning_method
practice,
pragmatics_processing,
preceding_words
preceeding
precision
precision_rate
predicate-argument_structures
predicate_calculus_notation
predicative_information
predictably
predicting
predicting_top-level_boundaries,
predictions
predictive_performance
predictive_questioning
predominant_senses
preference
presence
present
presented
presented,
presumed
presuppositional_nature
previous
previously
primarily
priming
primitive_Optimality_Theory_(OTP),
principle-based_theory
principled
printed_text
prior_knowledge
priors
probabilistic context-free grammars
probabilistic_Horn_clauses
probabilistic_context-free_grammar
probabilistic_context-free_grammar_(PCFG)
probabilistic_context-free_grammars
probabilistic_finite_automata
probabilistic_finite_automaton
probabilistic_model
probabilistic_spectral_mapping
probabilistic_synchronous_dependency_insertion_grammar
probabilistic_translation_models
probabilities
probability-based_scoring_function
probability_estimation
problem
problem,
problematic
problems
procedural
procedures
process
processes
processing
produce
produced
produces
program
program,
programming_language
projecting
projection_of_structures
prominence
pronominal_anaphora_resolution_module
pronominalization,
pronoun
pronoun_"it"
pronoun_il
pronoun_resolution
pronouns
proof procedure
proper
proper_names
properties
proportion_problem
proposed
proposition
prosodic
protocol_analysis
prototype_system
provide
provided
provides
providing
pruning_criteria
psycholinguistic_literature
published
punctuation
purpose
purposes
pushdown_automaton
put
qualitative_spatial_constraints
quality
quantification_over_events
quantified_sentences,
quantifying_noun_groups
queries
query_optimisation
query_terms
question-answer_pairs
question-answering_NL_systems
question-focused_sentence_retrieval
question/answer_pairs
question_phrases
questions
randomly
range_concatenation_grammar_[RCG]_formalism
range_concatenation_languages_[RCL]
rank
rank,
ranking
ranking_algorithm
ranking_learning_problem
ranking_problems
ranking_rules
rankings
ranks
rate
rather
rating
raw_text
readily
real
real-valued_features
real-world entities
reasonably
reasoning_with_dispositions
recall,
recent
recently
recognition
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
recognition_network
recognition_of_extra-grammatical_input
recognition_technology
recognizer
recognizing
recordings
reduce
reduced
reduced_IL_formulae
reduplication
reduplications
reestimation_formulas
reference
reference_model
reference_sets
references
referential_elements
referential_information
referential_properties_of_noun_phrases
referents
referring_expressions
reflect
regarded
regular_expressions
regular_languages
related
relation extraction
relational_database
relations
relationship
relative
relative clauses
relative_error_rate_reduction
relative_frequency_of_occurrence
relatively
relevance
relevant
reliable
relied
rely
relying
remains
replete
repository
represent
representation
representation_scheme
representation_tree
representations
represented
represents
require
required
requirements
requires
requiring
research
research_articles
resemble
resolution_component
resolve
resolves
resolving
resource
resource-frugal_approach
respect
respectively
restricted_natural_language
restricted_subset
restricted_vocabulary
restrictive_statements
result
resulting
results
retrieval
retrieval_approach
retrieval_effectiveness
retrieval_performance
retrieve
revealed
reversible
revision_component
rhetorical_patterns
richer
right-side dependencies
robust
robust---an
robust_explanation_system
robust_generator
robustness
robustness_problems
role
root_word_lexicon
roots_words
rule-based_heuristics
rule-based_learning_algorithm,
rule-based_systems
rule-based_translation_systems
rule-invocation_strategies
rules
run
running
runs
s-VSM_model
salience
same
satisfactorily
saturation
scenario_templates
scf types
scfs
scientific
scope_ambiguity
scoring
scratch
scripts
scruffy_texts
search
search engine
searched
second_language_and_cognitive_skill_acquisition
seed_sentences
seeds
seem
segment
segment-based_approach
segment_boundaries
segment_order-sensitive_methods
segmentation
segmentation bakeoff
segmentation_standards
segmented_strings
segments
select
selected
selecting
semantic
semantic constraints
semantic network
semantic-oriented_NLP_applications
semantic_analyzer
semantic_annotation
semantic_caseframe_instantiation
semantic_composition
semantic_constraints
semantic_criterion
semantic_distance
semantic_domain_models
semantic_equivalence
semantic_expressibility
semantic_information
semantic_interpretation
semantic_relations
semantic_representation
semantic_role_labeling
semantic_role_labeling,
semantic_verb_classes
semantically_annotated_corpus
semantically_related_words
semantically_rich,_large-scale_knowledge_bases
semantically_unmarked_term
semantics
semantics_directed_approach
semi-supervised_methods
sense
sense-tagged_training_data
sense_priors
sense_resolution
senses
sentence
sentence-level_and_text-level_anaphora
sentence-level_semantic_equivalence_classification
sentence_analysis
sentence_co-occurrences
sentence_extraction
sentence_plan
sentence_plans
sentence_retrieval_problem,
sentences
sentences,
sentential_paraphrases
sentiment_vector_space_model_(s-VSM)
sequences
sequential_models
series
serves
set
sets
several
severely
shallow_linguistic_features
shallow_mapping
shallow_techniques
share
shared_derivation_forest
shared_lexical_information
sharing
shift-reduce_dependency_parsers
should
show
showing
shown
shows
sides
significance
significant
significantly
similar
similar_context_features
similarity
simple
simple_clausal_structures
simplify
single
single-snippet_answers
single-strategy_parsers
size
skips
small
small,_domain-specific_corpus
small-scale
smaller
smoothing
so
software
software_library
solution
some
sometimes
song_lyric_document
song_lyrics
sounding
source of data
source_and_target_language_sentences
source_dependency_parse
source_interval_projections
source_language
source_language_text
space
sparsity_of_the_feature_space
spatial_attributes
spatial_descriptions
speaker
speaker-independent_(SI)_training
speaker_adaptation_(SA)
special
specialized_parsing_techniques
specific_heuristics
specifications
specified
spectral_clustering_based_approach
speech
speech-based_Information_Retrieval_(IR)
speech_and_text-image_recognition
speech_and_text_image_processing
speech_data
speech_processing
speech_processing,
speech_recognition
speech_recognition_hypotheses_(SRH)
speech_synthesis_systems
speech_understanding
speeches
speed
spelling-checkers
spelling_correction
spoken_corpora
spoken_dialogue
spoken_dialogue_system
spoken_dialogue_systems
spoken_language
spoken_language_corpus
spoken_language_technology
spoken_language_understanding
spoken_language_understanding_system
spoken_multiparty_dialogue
spontaneous_speech
stack
stages
standalone_system
standard
starting
state-of-the-art_coherence_model
state-of-the-art_performance
statistical_MT_performance
statistical_alignment_models
statistical_alignment_techniques
statistical_analysis
statistical_and_constraint-based_disambiguation
statistical_approaches,
statistical_information
statistical_learning_mechanisms
statistical_machine_translation
statistical_machine_translation_(MT)
statistical_machine_translation_(SMT)
statistical_method
statistical_methods
statistical_model
statistical_models
statistical_parameters
statistical_parser
statistical_profile
statistical_techniques
statistical_translation_model
statistics
stemming_model
stems
stereotyped_text_structure
still
stochastic,_graph-based_method
stochastic_output_selection
stored
story
straightforward
strategies,
strength_of_potential_antecedence
strengths
strictly_syntactic_cross-serial_agreement
string_similarity
strong
strongly
structural_and_lexical_dependencies
structural_information
structure
structure-sharing_of_graphs
structure_of_communicative_context
structured
structured_data
structured_databases
structured_natural_language_data
student
studied
subcategorization_acquisition
subcategorization_classes
subcategorization_cues
subcategorization_dictionary
subcategorization_frame_(SCF)
subcategorization_frames
sublanguage,
subordinate_clause
subpredicates
subset
subset_of_logic
substantial
substitutions
substrings
subtrees
success,
such
suffix_analysis
suffix_array-based_data_structure
suggests
suitable
summarization
summary
summary_generation
summations
summing
superior
superordinate -hyponym relation,
superordinate_substitution
superset_of_L
supervised_and_unsupervised_methods
supervised_learning
supervised_training_data
support
support_vector_machine
supported
supports
surface_English
surface_forms
surface_realizations
surface_representation
survey
symbolic knowledge
synchronous dependency parser
synonym relation
synonymous expressions
syntactic_ambiguity_resolution
syntactic_analysis
syntactic_analysis_system
syntactic_analyzer,
syntactic_and_semantic_dependencies
syntactic_behavior
syntactic_categories
syntactic_coverage
syntactic_cues
syntactic_descriptions
syntactic_disambiguation
syntactic_information
syntactic_priming
syntactic_structure_features
syntactic_structure_information
syntactically_motivated_relations
syntactico-semantic_(tectogrammatical)_annotation
syntax
syntax,
syntax-based_constraint
syntax-based_statistical_machine_translation_system
syntax_directed_approach
syntax_proper
synthesizes
system
system's_output
system_output
system_performance
system_response
systemic_grammar
systems
tag
tagged
tagger
taggers
tagging
tagging_strategies
tailoring
take
takes
target
target speaker
target_corpus
target_document
target_vocabulary
task
task-oriented_dialogs
task-specific_domain_knowledge
task-specific_language_development
task_representation
tasks
taxonomic_similarity
technique
techniques
temporal_adverbials
temporal_anaphora_phenomena
temporal_connective
temporal_expressions
temporal_logic_CTL
temporal_relations
temporary_belief
tend
tenses
term_aggregation_system
term_extraction
terminology_structuring
terms
terms,
test
test_corpora
test_corpus
test_language
test_set
tests
text
text collections
text,
text-level_anaphora
text-plan_input
text-to-speech_conversion_system
text-to-speech_form
text_applications
text_browser
text_classification_problems
text_corpus
text_generation
text_mining_method
text_model
text_processing
text_processing_software
text_processors
text_understanding
texts
textual
textual_corpora
textual_corpus
textual_credibility_indicators
textual_domain,
textual_representation
than
that
the
their
them
thematic_grid_tagging,
then
theoretical_linguistic_investigations
theories
theory
theory_of_attention,_intention,_and_aggregation_of_utterances
there
thesaurus
thesaurus_construction
these
they
this
though
threading_algorithm
threads
through
thus
tie
time
time_O(|G||w|3-e)
time_exponential_on_the_size_of_the_grammar
times
to
together
token-based_models
token_classification_task,
tool
tools
top-down_derivation
top_human-ranked_sentence_plan
topic
topic_information
topic_signature
topic_signatures
topical report,
topical_blog_post_retrieval
topics
towards
track
tracks
tractable
traditional
traditional_MT_architectural_designs
traditional_deterministic_parsers
traditional_distributional_word-distance_measures
traditional_knowledge-based_techniques
train
trainable_components
trainable_sentence_planner
trained
training
training_(reference)_speaker
training_and_test_data
training_and_testing_factors
training_corpus
training_data
training_examples
training_material
training_method
training_resources
training_speakers
training_techniques
trajectory
transcribing
transcription_errors
transfer_approach
transfer_component
transfer_phase
transformation_model
transformed
transition_graphs
translates
translation
translation lexicons
translation_accuracy
translation_candidates
translation_data
translation_framework
translation_hypotheses
translation_images
translation_knowledge
translation_lexicon
translation_lexicons
translation_memory_system
translation_paths
translation_performance
translation_quality
translation_relation,
translations
transliteration
transliteration/backtransliteration_experiments
transliteration_process
treat
treated
tree
tree-bank
tree-to-tree_translation
tree_adjoining_grammar
treebank
trees
trend
triple
tune
tutorial_dialogue
two
two-phase_shift-reduce_dependency_parser
two-step_clustering_process
type
typed_feature_structures
types
types_of_knowledge
typicality
unadulterated
unambiguous_structures
unannotated_text
under
underpinning,
underspecified representations
underspecified_semantic_representation_(USR)
underspecified_semantic_representations,_here_Underspecified_Discourse_Representation_Structures_(UDRSs)
understanding
undisambiguated
unequal
ungrammatical input
ungrammatical segmentations
ungrammatical_input
ungrammatical_structures,
unification
unification-based_grammar
unification-based_grammar_formalism
unification-based_grammar_parsing
unification-based_grammatical_frameworks
unification-based_linguistic_descriptions
unification-based_parsing
unified
uniform_processing
unigram
unique
unit
units
unknown_word
unknown_words
unless
unlexicalized_PCFG_parser
unlexicalized_parser
unpleasant
unrestricted_texts
unseen_data
unsegmented_Arabic_corpus
unsegmented_corpus
unsupervised learning
unsupervised_algorithm
unsupervised_automatic_acquisition
unsupervised_learning
unsupervised_learning_algorithm
unsupervised_learning_approach
unsupervised_learning_method
unsupervised_methods
unsupervised_training
up
upon
us
use
used
useful
useful_terms
usefully
user
user-directed_summaries
user-specified
user_interface_styles_or_conventions
user_knowledge_modeling_architecture
user_model
user_modeling
users
uses
using
usual
usually
utilized
utilizes
utilizing
utterance
utterance_classification
utterances
vagueness
valid
valuable
variable
variant
varied
variety
various
vast
vector_space_model
vectors
vectors_representing_morpho-syntactic_properties
verb
verb-noun_collocation_dictionary_for_Polish
verb_final_language
verb_form_meanings,
verb_forms
verb_semantics
verbal_and_nonverbal_grounding_acts
verbal_interactions
verbs
version
very
via
viewed
viewpoint
virtual_reality_3D_scene_modeling_software
visualization_method,
vital
viz.
vocabularies
vocabulary
vocabulary),
voice_input
voice_interactive_system
volume
was
way
ways
we
weaknesses,
weather
web
weight
weighted_finite-state_device
weights
well
well-written_discourse
well_calibrated_probabilities
well_calibrated_probabilities,
were
what
when
where
whether
which
while
who
whole
whose
wide
widely
wildcards
will
with
within
word
word's
word-aligned_corpora
word-based_alignments
word-based_collocational_properties
word-based_models
word-based_system
word-dependent_substitution_costs
word-lemma_based_feature_function_models
word-lemma_model
word-sense_ambiguity
word-sense_disambiguation_algorithm
word-sense_disambiguation_systems,
word-senses
word-to-word_alignments
word-trigram_recognition
word_alignment
word_clustering
word_clusters
word_error_rate
word_error_rate_(WER)
word_examples
word_forms
word_graph
word_n-grams
word_order
word_pairs
word_segmentation
word_segmentation_problem
word_sense_definitions
word_sense_disambiguation
word_sense_disambiguation_(WSD)
word_sense_disambiguation_(WSD)_systems
word_senses
word_significance
word_significance_(weights)
word_string
word_tokens
word_vectors
wordbreaks
words
words,
words_with_multiple_meanings
work
working
world
worse
would
write
writing
written
written_English
written_and_spoken_language
written_texts
yield
yields
young
zero pronouns
~
~0.25%
–
