"black-box"_methodology
"conventional"_context-free_morphological_grammar
"glue_language"
"noun_+_NO"_(in_English_"of_+_noun")_structures,
"one-time_look_up"_method
'
'Pendulum_Algorithm'
's
'the
(
(Biber,1993;
(Bikel,
(German-English,
(Karttunen,
(P05-1076.10
(almost)
(and
(called
(e.g.
(for
(from
(in
(konpyuutaa)
(using
)
-
--
-speaking
0(n)_time
000
1
1.6
10
100,000
113K
12.5%
126,610
155
160
1983)
1983;
1993_ARPA_WSJ_evaluation
2.284
2003
2004)
20k
23,000
2491
28,449
35.0%
40
491,000
5%
6
7.5%
70%_precision
77%
79.1%
80.5%
8000-word
87.5%
88.9%
89.75%
97%
97.24%
<
AAC
AAC_edition_philosophy_and_edition_principles
AI_problem_solving_techniques
AI_text_generation
API
APT
AQUAINT_corpus
ARBITER,
ARPA_large-vocabulary_CSR_corpora
AS-closed,
AS-open,
ASR
ASR_output
ATIS_(Air_Travel_Information_System)_domain
A_deterministic_parser
Acoustic_modeling
Ambiguity
American Sign Language (ASL) animation
Arabic
Arabic-English
Arabic-English_BTEC_and_NIST_tasks
Arabic_information_retrieval
Arabic_language
Arabic_word
Arabic_word_segmentation
Arabic_word_segmentation_system
Arabic_word_segmenter
Augmented_Transition_Network
Augmented_Transition_Network_(ATN)_model
Automatic_Speech_Recognition_technology
BLEU
BMM_algorithm
Basque
Bayesian_learning
Bayesian_semi-supervised_Chinese_word_segmentation_model
Bikel's_parser
Boolean_conditions
Boolean_matrix_multiplication_(BMM)
Bulgarian,
CAS
CCLINC_Korean-to-English_translation_system
CCR_formalism
CFG filter
CFG_parser
CFG_parsers
CFG_parsing
CFG_rules
CF_grammars
CMU
CRF
CRFs
CRL's_TIPSTER_User_Interface_Toolkit_(TUIT)
CSG
CSR
CT
CTL
CWS
Chat-80
Chi_Square_(%2)_analysis
Child_Language_Data_Exchange_System_(CHILDES)
Chine_language
Chinese,_Arabic,_and_English_non-parallel_newspaper_corpora
Chinese-English_machine_translation_system
Chinese-speaking_regions
Chinese_language,
Chinese_language_processing
Chinese_newspapers
Chinese_nouns
Chinese_punctuation_marks
Chinese_punctuation_marks,
Chinese_text
Chinese_text_corpora
Chinese_text_input
Chinese_verb_sense_discrimination
Chinese_word_segmentation
Chinese_word_segmenter
Chinese_word_sense_disambiguation_model
Chinese_words
CoNLL_2008_shared_task
Coedition
Collins,
Collins_(2000)_reranker
Combination_methods
Combinatory_Categorial_Grammar_(CCG)_lexicon
Comparator
Comparator_software
Conceptual_Dependency_Theory
Conditional_Maximum_Entropy_(CME)_classifier
Conrath
Construct_Algebra
Cooperative_Model
Coreference_resolution_systems
CriterionSM_Online_Essay_Evaluation_Service
Czech
Czech-English_statistical_machine_translation_system
Czech_WordNet
DARPA_Resource_Management_corpus
DARPA_Spoken_Language_Systems_(SLS)_program
DRT
DUC-2005
Definite_Clause_Grammar_techniques
Dialogue_strategies
Dictionary_construction,
Discourse_Representation_Theory
DoPS_system
Dutch
Dutch_Senseval-2_test_data
Dynamic_Hierarchical_Phrasal_Lexicon_(DHPL)
EBMT
ECA
ECD
EDOL
EM-algorithm
EM_algorithm
EUROPARL_corpus
Elicitation_Corpus
English
English text
English,
English,_Arabic_and_Spanish_lexicons
English-Chinese_bitexts
English-Chinese_parallel_corpora
English-French_document_pairs
English-Japanese,
English-Japanese_machine_translation,
English/Chinese_and_English/Japanese_language_pairs
English_Wikipedia,
English_corpora
English_past_tense
English_questions
English_sentence_structure
English_translation
Estonian-English
Expectation-Maximization_(EM)_algorithm
Expectation-Maximization_(EM)_clustering_algorithm
F-Score
F-measure
F-measures
FACILE,_a_EU_project_for_multilingual_text_classification_and_IE
FDA
F_measure
French
French_tenses
GLOSSER
GPSG
GUIs
Gaussian_mixture
Generalized_Alignment
Generalized_Quantifier_approach
German
German_Ph@ttSessionz_speech_database
German_corpus
German_documents
German_module
German_nouns
German_pronouns
German_text_corpora
Graph_unification
Graphical_User_Interface_(GUI)_functions
Grosz-Sidner-style_focus_model
HBG
HBG_model
HDAG_Kernel
HDAGs
HK-closed,
HK-open,
HMM-based_chunk_tagger,
HMM_and_Max-ent_models
HMM_training
HMM_with_Gaussian_mixture_observation_densities
HPSG
HPSG_natural_language_system
HTK_large_vocabulary_speech_recognition_system
HTML_documents
Head_Grammars
Hidden_Markov_Model
Hierarchical_Directed_Acyclic_Graph_(HDAG)_Kernel
Hindi
Hong
Horn_clauses
Human-Machine_Communication
IBM_models
IBM_translation_models
ICICLE_system
IE-enhanced_text_browsers
IE_module
IE_paradigm
ILIMP
IR
IR,
Indian_languages
InfoMagnets
Information_Bottleneck
Information_Extraction
Information_extraction_techniques
IntEx_system
Intel_i860_chip
Internet
Intra-sentential_quality
Isomorphic Grammars
Italian
Italian and English verb subcategorization frames (SCFs)
JAVELIN
JAVELIN_system
JINTACCS_messages
JRC-Acquis_corpus
Japanese
Japanese-English_translation,
Japanese_Dictionary_Task_in_SENSEVAL2
Japanese_character_strings
Japanese_compound_nouns
Japanese_language
Japanese_language_dictionary
Japanese_morphological_analysis
Japanese_natural_language_processing_studies
Japanese_parsers
Japanese_patent_claim_sentences
Japanese_script
Japanese_sentence_analyses
Japanese_sentence_structure
Japanese_text
Japanese_text_processing
Japanese_unknown_words
Japanese_verb_phrases
Jiang
KDS
KL-Conc,
KL-ONE
KL-ONE-like_knowledge_representation_systems
KL-ONE_style_representation
KPSG
Kong
Korean
Korean-English_translation
Korean-to-English_and_a_Japanese-to-English_dictionary
Korean-to-Japanese_dictionary
Korean_and_English_language_pairs
Korean_phonological_knowledge_base_system
Koskenniemi,
Kullback-Leibler_distance,
LCS_representations
LEXSYS
LFG
LFG_semantics
LINK
LM
LMs
LR-parser
LR_parsing_tables
LR_shift-reduce_parsing_table
LSA-based,_cooccurrence-based_and_dictionary-based_methods,
LSA-based_and_the_cooccurrence-based_word_vectors
LSP-MLP_system_(Linguistic_String_Project_-_Medical_Language_Processor)
LTAG
LT_(LF)
Languages
Large-scale_natural_language_generation
Latent_Semantic_Analysis_(LSA)
Law_School_Admission_Test_(LSAT)
Lexical-Functional_Grammars_(LFG)
Lexicalized_concepts
Log-linear_models
Longman_Dictionary_of_Contemporary_English
Lucy
M
MBR_decoders
MBR_decoding
MEDLINE_abstracts
MFCDCN_method
MORphological_PArser_MORPA
MSR- closed
MSR-open
MT
MT,
MT-based_paraphrasing_technique
MT_evaluation
MT_evaluation_methods_(BLEU,_NIST,_WER_and_PER)
MT_evaluation_techniques
MT_output
MT_system
MT_systems
MUC-6 and MUC-7 English NE tasks
MWEs
MWEs_database
Machine_Translation
Machine_Translation_(MT)_systems
Machine_transliteration/back-transliteration
Markov_model
MeSH
MeSH_relations
Memo-functions
Message_Understanding_Conferences
Metagrammatical_formalisms
Mimo,
Mimo_formalism
MiniSTEx
Minimum_Bayes-Risk_(MBR)_decoding
Minimum_Bayes-Risk_framework
NER
NL
NLG_components
NLP
NLP-system_for_Dutch_(Dutch_Medical_Language_Processor_-_DMLP)
NLP_system
NLP_tasks
NL_evaluations
NP
NP-_and_non-NP-antecedents
NP-complete
Nagao,1993;
Name List,
Named_Entity_(NE)_tagging
Named_Entity_task
Natural_Language_Processing_(NLP)_applications
Natural_Language_Processing_(NLP)_system
Nigam
Node-based_inference
Node-based_inference_rules
Noun Classifier Associations (NCA)
Numeric_scores_of_relatedness
O(n6)_time
OCR
OT
OWL_ontology
P-CFG
PAKTUS
PCFG
PCFG-LA
PCFG-LA model
PER
PK-closed,
PK-open,
PNR2,
POS tags in English,
POS_learning
POS_tagger
Paramax_spoken_language_understanding_system
Parseval metric
Path-based_inference
Path-based_inference_rules
Penn_Treebank_Corpus
Penn_Treebank_data
Penn_WSJ
Penn_discourse_annotation
Plume
Plume's_approach_to_parsing
PoS-tag_feature_function
PoS_tagger
Polish
Polymorphemic_stems
Prague_Dependency_Treebank
Praguian_dependency-based_approach
Preferred_antecedents
Presentor
Procedural_Systemic_Grammar
Prolog
PropBank
Proposition_Bank_data
Pundit
Q/A
QA_system
RAREAS
RCL_parser
RCL_parsers
RINA,
RSS_feeds
RTE3
RTE3_task
Recognition_of_proper_nouns
Reduplication,
Rhetorical_Structure_trees
SCFs
SCFs_distributions
SI recognition,
SI_corpus
SL
SLS_systems
SLU
SMT
SMT_models
SMT_research_community
SPoT
SRHs
SRI_toolkit
SSTC
STRAND
STSSG
SUN4
SVM
SVM_algorithm
SVM_learning
SVMs
Segmentation
Semantic_theories
Sentence_boundary_detection
Similarity-driven_Transfer_System_(SimTran),
Situation_Theory
Slavic language
Slavic languages
Smadja,1993)
Source_and_Target_languages
Southern_Min_Chinese
Spanish
Spectral_Graph_Transducers
Speech_recognition_problems
Spelling-checkers
Spoken_Language_Systems_(SLS)
Statistical_Machine_Translation_(SMT)
Statistical_language_modeling,
Support_Vector_Machines
Syllogistic_reasoning_with_dispositions
Syntactic_and_semantic_information
Syntax-based_Machine_Translation_systems
Systemic_grammar
TAG
TAGs
TAP-XL_Automated_Analyst's_Assistant
TIPSTER_Architecture_specification
TIPSTER_applications
TIPSTER_technology
TL
TRDR_score
TV_shows
Taiwan_Child_Language_Corpus
Task-based_evaluation
Temporal_Expression_Anchoror_(TEA),
Term_similarities
Thai_key_prediction
Thai_text
TiMBL,
Topic_Detection_and_Tracking_tasks
Topic_signatures
Transductive_SVMs,
Translations
Tree_Adjoining_Grammars
Turkish
Turkish_dependency_treebank
Turkish_word_structures
Unification_Categorial_Grammar_(UCG)
Untranslatable_named_entities
V&V
VI_subword_models
VME_bus
VSM_model
Verbmobil_task
WFSTs
WH-questions
WSD_models
WSD_programs
WSD_task
WWER
Wall_Street_Journal_articles
Wall_Street_Journal_treebank
Web
Web_documents
Weighted_Finite_State_Transducer_(WFST)
Why-Atlas
Wizard_of_Oz_technique
WordNet
WordNet,
WordNet-based_measures,
Word_Sketch_Engine,
Words
XTAG
Xerox_PARC
[5]
[ANA]
[Zernik88],
a
abduction
abductive_inference
ability
able
about
abstract
abstract_flat_syntactic_representations,_LFG_f-structures,
abstract_knowledge_representation_(AKR)
abstract_moves
abstraction
abstractions
abstracts
access
accessing
according
account
accuracies
accuracy
accuracy_rate
accurate
achieve
achieved
achieves
achieving
acoustic_recognition
acquire
acquired
acquiring_adjectival_subcategorization_frames
acquisition_of_word-semantic_information
across
ad
adapt
adaptation
adapted
adaptive_learning_procedure
added
adding
addition
additional
address
addressed
addressee_identification
adequate
adjacent
adjectives
adnominal_constituents
adolescent_speakers
adopt
adopts
advanced
advances
advantage
advantages
advertisements
affects
affix_removal
after
against
agenda-based_scheduling_parser
agglutinating_free_word_order_language
agglutinative_language
agglutinative_languages
agree
agreement
aid
aids
aims
al.
algorithm
algorithm_for_translation_lexicon_acquisition_(SABLE),
algorithms
aligned_bilingual_corpus
alignment
alignment_adaptation_approach
alignment_errors
alignment_results
all
alleviate
allow
allowing
allows
alone
along
alphabets
also
alternative
alternative_markers
ambiguities
ambiguity
ambiguity_packing_and_stochastic_disambiguation_techniques
ambiguity_representations
ambiguity_resolution
ambiguous
ambiguous wordform,
ambiguous_adjectives
ambiguous_modified_noun
ambiguous_word
among
amount
amounts
an
analogies
analysed
analyses
analyses_for_large_treebank_grammars
analysis
analysis_mechanism
analyst
analytical_components
analytical_inverses
analyze
analyzer,
anaphora
anaphora_references
anaphoric_component
anchor_group_approach
and
annotate
annotated
annotated_data
annotated_examples
annotating_scheme
annotation
annotation_error_rate
annotation_scheme
another
answer
answer/question_terms
answer_candidates
answer_expressions
answer_extraction
answer_resolution_algorithm
answering_agents
answers
antecedence_recovery
antecedent
antonymous_adjectives
any
apartment
appear
appears
application
applications
applied
applied_and_theoretical_computational_linguistics
apply
applying
approach
approaches
appropriate
approximation
approximation_error
arbitrarily
arbitrary
arbitrary,
architectural_modules
architecture
are
areas
argued
argument_frames
argument_structures
argumentation_system
arguments
around
articles
as
aspects
aspectual_operation_system,
assigned
assigning
assignments
associated
associative_relationship
associative_relationships_between_verb_phrases
associative_similarity
asymmetric,_or_directional,_relations
at
attain
attempt
attentional_focus
attentional_state
attentional_structure_in_discourse
attractive
attribute_sequences
attributes
audio_and_scanned_image_data
augment
augmented
augmented_Friedman_-_Warren_algorithm
augmented_context-free_grammars
author
automated_evaluation_techniques,
automated_interpretation
automatic
automatic_Q/A
automatic_abstracting_systems,
automatic_adaptation
automatic_alignments
automatic_discovery_of_text
automatic_estimation_method
automatic_evaluation
automatic_evaluation_measures
automatic_evaluations
automatic_extraction
automatic_information_nuggetization
automatic_language_identification
automatic_method_for_evaluating_definition_questions
automatic_metrics
automatic_scoring_method
automatic_segmentation
automatic_sentence_extraction
automatically
automatically,
automatically_acquired_parallel_corpus
automaton
auxiliary
available
available,
average
averaging
aware
backward_maximum_matching
backwards_transliterations
bag-of-words_and_segment_order-sensitive_string_comparison_methods,
bag-of-words_methods
bare_slice_disambiguation
base_parser,
based
baseline
baseline_system
basic
basis
be
beam-search_decoder
bearing
because
become
been
begin
behavioral_patterns
being
benchmark_system
benefit
benefits
best
best-path,_bottom-up,_deterministic_parser
best-reported
better
between
beyond
bi-lingual_parallel_data
biases
bibliographic
big
bigram pass
bigram-to-trigram_decoder
bigram_back-off_language_models
bilingual_corpora
bilingual_dependency_relations
bilingual_dictionaries
bilingual_dictionary_coverage
bilingual_material
bilingual_parallel_corpus
bilingual_sentences
binary_relational_calculus_notation
binary_relations
biological_entities
biomedical_and_linguistic_ontologies
biomedical_text
biomedical_texts
bit-vector-based_CKY-style_parser
bit-vector_operations
blackboard-like_architecture
block_reordering
block_selection_criteria
blocks
blog_posts
board
body
boosting_approach
bootstrap
bootstrapping_approach
bootstraps
both
bottom-up_pattern-matching_parser
boundaries
breadth-first_search
broad
broad_coverage_lexicon
build
building
built
but
by
calculus
called
can
candidate
candidate_parses
candidates
cannot
capability
capable
capitalization
capture
captured
captures
carried
carry
case-based_MT_(CBMT)
case-based_reasoning
case_frame_information
categories
categorization
categorization_task,
category
category_labels
ccg_parsing
ccg_supertagging
centering approach
central
cepstrum-based_features
certain
certainty_conditions
certification
challenge
challenges
changes
character
character-_and_word-segmented_data
character_and_word_error_rate
character_bigrams
character_clustering
character_types
characteristics
characterize
characterized
characters-based_Chinese_collocation_system
chart-based_phrase_structure_parsing
chart_parsing_algorithm
check
checking
children
children's
choose
chunking
chunking_performance
chunking_problem
chunking_results
chunks_of_words
circuit_specifications
citations,
citing
claimed
class
class-based_smoothing
class-oriented_framework
class_of_languages
classes
classification
classification-based_representation_techniques
classification_method
classification_problems
classified
classifier
classifier_assignment
classifier_word
classifiers
clauses
closely
clues
clustered_encoding
clustering
clustering_and_filtering_processes
clustering_methods
clusters
co-occurrence_distribution
co-occurrence_information
co-occurrence_patterns
co-occurrence_similarities
co-occurrence_statistics
coarse-grained_concepts,
coarse-level_clustering
coarticulation
cognitive_psychology
cognitively_well-motivated_interfaces
cognito-pragmatic
coherence
coherence_assessment
coherent
coherent_text
cohesive text
collected
collecting
collection_of_dialog_motivators
collection_of_relations_and_operations
collocations
combination_methods
combine
combined
combines
combining
combining,
comes
comma_checker
commercially
common
common_text_processing_modules
commonly
commonsense_reasoning
communicative_signals
compact
compactly
comparable
comparable,_non-parallel_corpora
comparative
compare
compared
comparison
compensation_algorithms
compete
competitive
complete
completeness
complex
complex_sentences
complicated
component
components
composed
compositional_approaches,
compositional_interpretation
compositional_syntax_rules
compositionality
compound nouns
compounds
comprehensive
compression_ratio
comprising
computational
computational_complexity
computational_lexicon
computational_linguistics
computational_methods
computational_model
computational_problems
computational_semantic_analyses
computational_theory
computationally
computed
computer-assisted_acquisition_and_morpho-syntactic_description_of_verb-noun_collocations
computer_text_generation_system
computing
concatened
concept
concept-concept_matrix
concept-distance_measures
concepts
conceptual
conceptual_level
conceptual_operations
conceptual_system
conceptualising
conceptually
concrete_noun
conditional_log-linear_model,
conditional_loglinear_models
conditioning variables
confidence
confidence_measures
configurable
confirmed_knowledge_base
confusion_network
conjunction
conjuncts
connectionist_(neural)_network
connectionist_component
connectivity
consensus_translation
consequences
consider
considerably
considered
consist
consistency_problem
consisting
consists
consort
constituent
constituent_parts
constituent_structure_trees
constitute
constraining
constraint
constraint_system
construct
constructed
constructing
construction
construction-specific_approach
constructions
constructs
contain
containing
contains
content-independent_formalism
content_words
context
context-free_chart_parsing
context-free_grammars
context-free_languages
context-free_parsing
context-free_phrase-structure_grammar
context-free_phrase_structure_rules
context-sensitive,_phrase_structure_grammar
context_free_languages
contexts
contextual_effects
contextual_similarity
continuous_density_HMM
continuous_speech
continuous_speech_recognition_(CSR)_techniques
contributes
control
control_structure
conventional_statistical_methods
conventionally
converge
conversation_analysis
conversation_transcripts
convey
convolution_kernel
cooccurrence
cooccurrence_patterns
cooccurrence_statistics
cooperative
cooperative_responses
coordinate_phrases
coordinations
core
core_modules
coreference_resolution_systems
corpora
corpora_quality
corpus
corpus-based sample
corpus-based_approach
corpus-based_method
corpus-based_supervised_word_sense_disambiguation_(WSD)_system
corpus_data
corpus_of_speech-based_computer_tutoring_dialogues
corpus_of_training_texts
corpus_text
correct
correctly
correctness
correlate
correlation_measure
correspond
corresponding
corresponds
costs
could
co–occurrence_information
create
created
creates
creating
creation
credibility_indicators
critical
critical_discussion
cross-entropy
cross-lingual_comparisons
cross-sectional_study
cross-word_triphones
crossed_serial_dependencies
crossing_liaisons
cruiser
cue_phrases
culling
current
currently
currently_available_technologies
customized
data
data-driven_semantics
data_access_method
data_objects
data_representation
data_representation_choice
data_representations
data_retrieval
data_sets
database
database_query_application
databases
deadline
deaf
deal
deals
decision-making
decision-tree_approach
decision-tree_classifier
decision_list
decision_strategies
decision_tree
decision_tree_architecture
decision_tree_based_approach
decision_tree_learning
decision_trees
declarative
declarative and imperative utterances,
declarative_formalism
declarative_languages
decoding
decoding_cascade_for_trigram_language_models
decoding_strategy
dedicated
deduced
deductive_approach
deep_processing
deeper
defeasibility
defeasible_reasoning
defeat_rules
define
defined
definite_clause_grammars
definition_sentences
definitions
delimiters
demonstrated
demonstrative_expressions
demonstrative_forms_and_functions
denotational_semantics
denoted
departure
depend
dependencies
dependency-based_grammar_model
dependency_analyser
dependency_parsing
dependency_relation_paths
dependency_relations
dependency_structure
dependency_structure_grammar
dependency_structures
dependency_tree
depending
derivation
derivational_history
derivations
derive
derived
derived_string
derived_strings
derived_words
describe
described
described,
describes
describing
description
descriptions
designed
despite
detect
detection
detection_of_syntactic_errors
determination
determined
determiners
determining
deterministic_finite_automaton
deterministic_grammar
deterministic_parsers
develop
developed
developed,
developing
development
deviates
devised
dialog_management_system
dialog_manager,
dialog_model
dialog_motivators
dialog_schemata
dialog_systems
dialogue
dialogue_acquisition_and_tracking_algorithm
dialogue_corpora
dialogue_interaction
dialogue_system
dialogue_systems
dialogue_translation_system
dictionaries
dictionaries_of_word_forms
dictionary
dictionary-based_approach,
dictionary-based_word_vectors
dictionary_word_sense_definitions
did
differ
different
different-quality_references
difficult
digital_learning
dimensionalized_space
direct
direct_orthographical_mapping_(DOM)
direction-giving_task
directionality
directly
disambiguate
disambiguation
disambiguation_algorithms
disambiguation_method
disambiguation_methods
disambiguation_tool
discontinuous_constituents
discourse
discourse segment,
discourse-level construct
discourse-relevant_purposes
discourse_connectives
discourse_constraint
discourse_context
discourse_copying_algorithm
discourse_level
discourse_processing
discourse_relations
discourse_segmentation
discourse_smoothness_index
discourse_structure
discourse_structures_and_interpretations
discourse_task
discourse_understanding_process
discourses
discovered
discovering_parallel_sentences
discriminative_log-linear_models
discriminative_training_criterion
discursive_usage
discusses
disjunctions
disjunctive_feature_structures
display_of_graphical_information
distance
distance values
distance_features
distinct
distinguish
distributed_message-passing_infrastructure
distribution
distributional_approximation
distributional_concept-distance_measures
distributional_hypothesis
distributional_word_feature_vectors
distributions
do
document
document-oriented_applications
document_collection
documents
documents_with_signal_content
does
domain
domain-independent
domain-independent_capabilities
domain-independent_means_of_evaluating_Spoken_Language_Systems_(SLS)
domain-specific_(in-domain)_word_alignment
domain-specific_ontology
domain-specific_semantic_information
domain-specific_translation_lexicons
domain-specific_word_alignment
domain_dependence
domain_entities
domain_independent_features
domain_independent_model
domain_knowledge
domain_ontology
domain_specific_terms
domains
domains:
done
dramatically
drawn
draws
duration_model
durative_/_non-durative_character
during
dynamic_combiner
dynamic_language_model_combination
dynamic_programming
dynamic_programming_(DP)
dynamic_programs
dynamically
each
easily
easy
easy-to-implement
edges
edit_distance
editor
educational_tool,
effective
effectively
effectiveness
efficiency
efficient
efficient,
efficiently
either
elaborated
electronic_discussions
electronic_newsgroup_discussions
element
elementary_structures
ellipsis
ellipsis_resolution
email-threads
email_communication
email_conversation
embedded
embodied
embodied_conversational_agent
emoticons
empirical
employ
employing
encoded
encodes
encoding-based_methods,
encyclopedia,
engineers
enhance
enhanced
enhances
enough
enriched_lexical_representations
enriching
ensemble_learning_approach
entailment_acquisition
entailment_relations
entire
entirely
entirely_data-driven_model_selection_procedure
entities
entity-based_representation
entity-oriented_parser
entity_pairs
entropy
enumeration
epistemological_level
equivalence
equivalences,
equivalent
error
error-correction_rules
error_correction
error_correction_mechanisms
error_rate
errors
especially
essays
essential
established
estimate
estimated
estimations
et
etc.,
evaluate
evaluated
evaluating
evaluation
evaluation_material
evaluation_measure
evaluation_measures
evaluation_method
evaluation_metrics
evaluation_of_Natural_Language_systems
evaluation_practices
even
event
event_detection_algorithm
event_map
event_structure
event_summarization_algorithm
event_terms
events
every
evidence
exact_match_accuracy
exactly
examined
example
examples
exceeds
excluded
exhibit
exist
existence
existing
existing_grammar
exotic,
expand
expanded
expectation-maximization_(EM)_based_word-clustering_algorithm,
expectations
expectations,
expected
expected_(grammatical)_sentences
expensive
experimental
experimental_evaluation
experiments:
expert_systems
explain
explanation_generation
explanation_system
expletive_occurrences
explicit
explicitly
exploit
exploits
exploratory_corpus_analysis
exploratory_questions
explore
exponential
express
expressed
expression
extended
extended_GLR_parsing_algorithm
extended_domain_of_locality_(EDOL)
extensive
extensively
extract
extracted
extracted_field
extracted_fields
extracting
extracting_subcategorization_frames
extraction
extraction_system
extraction_tool
extracts
f-structures
f0_measurements
faced
facilitate
fake
far
fast,
faster
feature-based relation extraction
feature-based_relation_extraction
feature-based_word_grammar
feature_functions
feature_selection_methods
feature_structure-directed_generation,
feature_structure_unification
feature_structures
feature_vectors
feature_weighting_and_selection_function
features
features,
feedback
few
fewer
field
field_structured_extraction_tasks,
field_structured_text
filled
filter
final
find
finding
fine-grained_grammatical_categories
fine-grained_semantic_categories
finite
finite-state_approximation
finite-state_method
finite-state_methods
finite-state_models
finite-state_parser
firmly
first
fits
five
flexibilities
flexible,
flexible_parser
flexible_parsing
focus
focus_of_attention
focussed
following
for
forecasts
formal
formal_analysis
formal_and_natural_language_processing_technologies
formal_definition
formal_intersections_of_FSAs
formal_language
formalising
formalism
formalisms
formalization
format
formatted_weather_data
formulas
formulate
formulated
forward_pass,
found
four
four-participants_face-to-face_meetings
fourteen
fragment
fragments
frames
framework
free-content
free-form_descriptions
free_indexation
free_word_order
frequency
frequency_classes
frequency_counts
frequency_profiles
from
full
full-form lexicon
full_NPs
full_parsing
full_scale_two-level_morphological_description
fully-connected_first-order_statistical_class_grammar
fully_anonymized_clinical_text
function_words
functional_structure
functions
fundamental
fundamentally
further
fuzzy_quantifier
fuzzy_quantifiers
fuzzy_syllogism
gain
gained
gains
gaps
gave
gene_and_protein_interactions
general
general,
general-purpose_NLP_components
general-purpose_texts
general_and_domain_corpora
general_domains
general_linguistic_knowledge
general_spoken_English
generalizable_semantic_principles
generalized_LR_parsing_algorithm,
generalized_metaphor
generalized_metaphor_mappings
generalized_translation_knowledge
generally
generate
generate)
generate,
generated
generates
generation
generation_module
generation_problem
generation_system
generative_history-based_latent_variable_model
generative_model
generative_model,
generative_probabilistic_model
generator
generators
generic
genetic_search
genre
genre-specific_regularities
genres
given
given_domain
gives
global dependencies
global_discourse
global_meaning
gloss_vectors
goal
gold-standard_data
gold-standard_parse_trees
good
good,
goshu_classes
goshu_information
graceful
grammar
grammar_PCFG*
grammar_checker
grammar_comparison_study
grammar_coverage_problems
grammar_formalisms
grammar_rules
grammar_sensu_stricto
grammars
grammatical_formalisms
grammatical_frameworks
grammatical_gender
grammatical_number
grammatical_relations
grammatical_sentences
grammaticality
grammatically_correct_input
graph
graph_based_sentence_ranking_algorithm,
graph_transformations
graphic_interpretation_system
graphical_model
graphics_displays
greatly
groupings
growing,
grs
guide
guided
habituality
hand-crafted_template-based_or_rule-based_approaches
hand_coding
hand_tagging
handle
handles
handling
hard decisions
hard_problems
hardness
hardware_designs
has
have
having
help
helpful
helping
heterogeneous_linguistic_corpora
heteronyms
heuristic_learning
heuristic_principles
heuristic_rules
hidden Markov models (HMM),
hidden-variable assignments:
hidden_Markov_model_(HMM)_and_maximum_entropy_(Maxent)_classifiers
hidden_variables
hierarchical_(or_other_types_of)_relations
hierarchical_lexicon
hierarchical_relations
hierarchically-structured_terminology
hierarchies
hierarchy
high
high-accuracy_word-level_alignment_models
high-quality_data
high-quality_lexicon
higher
highly
highly_inflective_languages
histogram
hoc
homogenising
honorifics
hope
house,
how
hubs
human
human language learners,
human-like_performance
human-machine_interactions
human_cognition
human_data
human_judgment
human_plausible_reasoning
human_transcription
human_transcriptions
human_understanding_of_natural_language
hybrid_generator,
hybrid_statistical_and_structural_semantic_model
hypotheses_graph
hypothesis
hypothesize
i/l:::'=--~--
ideas
identification_of_non-local_depenencies
identification_of_paraphrases
identifies
identify
identifying
ideograms
idiosyncracies
idiosyncrasies
ill-formed_input
illustrated
impacts
implementation
implemented
implements
implicit
implicitly
important
imposes
improve
improved
improvement
improvements
improves
improving
in
in-domain_corpus
in-domain_word_alignment
included
includes
including
incorporate
incorporated
incorporates
incorporating
increase
increased
incremental_and_normal-form_CCG_derivations
incremental_description_refinement
incremental_probabilistic_parser
incrementally
indeed
independent_classifiers
independently
independently trained models
indexing
indicators
indices
indirectly
individual
induced
induced_model
induces
industry_watch
inescapable
inevitable
inexpensive
inference
inference_types
inferential component
inferred
inflected_Arabic_words
inflected_forms
inflection
inflectional_morphology
inflow
influence
information
information workers
information_extraction_applications
information_extraction_system
information_extraction_tasks
information_extraction_techniques
information_flow
information_redundancy
information_retrieval
information_retrieval_techniques
information_source
informativeness
inherent
inheritance
initially
input
input_corpora
input_dataset
input_word
instance
instance,
instead
integral
integrate
integrated
integrates
integrating
integration
intelligent_mobile_agents
intelligibility
intense
intentional_structure
intentions
interaction
interactions
interactive_multi-party_seminars
interactive_problem_solving
interactive_question-answering_(Q/A)_system
interconnected
interesting
interface
interfaces
interlingua
interlingua_expression
interlingual_approach
internal_and_contextual_information
interpolation_methods,
interpret
interpretation
interpretation_and_generation_of_natural_language
interrogatives
into
intra-_and_inter-annotator_agreement
intractability
introduce
introduced
introduction
intuitive
involve
involves
irrelevant
is
issues
it
it,
its
itself
joint_model
judicious
keep
kernel_functions
key
keywords
kind
kinds
knowledge
knowledge-based_and_random_selection_procedures
knowledge-based_generation_systems
knowledge-based_mechanisms
knowledge-free_segmentation_algorithm
knowledge_base
knowledge_engineering
knowledge_extraction
knowledge_representation
knowledge_source
knowledge_sources
known
known_deterministic_parser
labeled
labeled_data
labeled_directed_graph
labeling
labelled_bracket_F-score
labels
laboratory_study
lack
language
language processing pipeline
language-independent_system
language_(L0)
language_acquisition
language_and_translation_models
language_factorization(s)
language_functionalities
language_identification
language_independent_modules
language_learning_model
language_model
language_modeling
language_modeling_approach
language_modeling_tasks
language_models
language_pairs
language_processing_systems
language_processing_tasks
language_specific_features
language_tutoring_application
languages
large
large-scale
large-scale_knowledge_base
large-vocabulary_CSR,
large-vocabulary_continuous_speech_recognition
large-vocabulary_speech_recognition
large_Czech_MWE_database
large_annotated_corpora
large_corpora
large_un-annotated_corpus
large_vocabulary_continuous_speech_recognition_(LVCSR),
largely
larger
latent_variable
latent_variable_model
lattice-based_approach
laws
layout
lazy_algorithms
leading
learn
learned
learners
learning
learning_algorithm
left_corner_parsing_algorithm
legacy_textual_databases
legal_terminology
legislation_texts
lemma
lemma-based_approach
lemma-based_model
lemma_identification
lemma_identification_task
lemmas
lemmatization
lend
less
level
levels
lexical category ambiguity
lexical,_syntactic,_morphologic_and_semantic_information
lexical,_syntactic,_semantic,_and_structural_information
lexical_affinity
lexical_ambiguity
lexical_and_syntactic_features
lexical_and_syntactical_variation
lexical_approaches
lexical_co-occurrence_data
lexical_cohesiveness
lexical_conceptual_structure_(LCS)_representations
lexical_coverage
lexical_database
lexical_disambiguation
lexical_entries
lexical_hierarchy
lexical_information
lexical_items
lexical_methods
lexical_sets
lexical_similarity
lexical_substitutions
lexical_translations
lexical_unknown,
lexical_weighting
lexicalised
lexicalized_grammar
lexicalized_structures
lexically-induced_relations
lexico-syntactic_knowledge
lexicologists
lexicon
lexicons
like
likelihood
limitations
limited
limited-domain_spoken-language_task
limits
linear-chain_conditional_random_field_(CRF)
linear_logic
linguistic information,
linguistic rules
linguistic_PoS_tagger_and_chunker
linguistic_analysis
linguistic_and_non-linguistic_knowledge
linguistic_annotation
linguistic_concepts
linguistic_domain
linguistic_expressiveness
linguistic_information
linguistic_introspection
linguistic_objects
linguistic_parser/generator
linguistic_phenomena
linguistic_processing
linguistic_representation
linguistic_resources
linguistic_structure
linguistic_structures
linguistic_theory
linguistically
linguistically_motivated_grammatical_resources
listener
literature,
little
live_closed_captions
local_and_global_properties
local_structure
localized_phrase-based_prediction_model
locally
log(d)_overheads
log-linear and linear interpolation,
log-linear_(maximum-entropy)_models
log-linear_block_bigram_model
log-linear_combination
log-linear_models
logic
logic,
logic_puzzles
logical_form_language
logical_formulas
logical_model
logical_well-formedness_conditions
long
loss_functions
lower
lower_bound_estimation
machine
machine translation (MT) systems
machine translation hypotheses
machine-generated_nuggets
machine-readable_dictionaries_(MRD's)
machine-readable_resources
machine_learning_algorithm
machine_learning_approach
machine_learning_techniques
machine_translation
machine_translation_(MT)_evaluation
machine_translation_(MT)_knowledge
machine_translation_decoding
machine_translation_output
machine_translation_outputs
machine_translation_pipeline
machine_translation_system
machine_translation_systems
machine_translation_task
machine_transliteration/backtransliteration
macro-average_F1
macro-average_F1_performance
macro-molecular_function
macromolecular_binding_relationships
made
magnitude
mails
mainly
maintains
make
makes
making
male_and_female_speakers
management_of_uncertainty
manifests
manner
manual_evaluation_methodology
manual_feature_selection
manual_transcription
manually_segmented_Arabic_corpus
manually_segmented_corpus
manually_sense-tagged_data
many
mapped
mapping_score
mappings
marine
marked
marks
markup_languages
mass
matches
mathematical_expressions
maximization
maximum-entropy_model
maximum_entropy_model
maximum_entropy_word_alignment_algorithm
maximum_likelihood_method
may
meaning
meaning-entailing_substitutability
meanings
means
measure
measures
measuring
mechanism
medical_literature
medium-length
meet
members
memory-based_learning_(MBL)
memory-based_learning_chunker
memory-based_system
met
meta-inference_types
metaphors
method
method_of_analyzing_metaphors
method_to_automatically_acquire_paraphrases
methodology
methods
metric
might
military_and_civilian_systems
million
minimizes
minor
miscues
mismatch_resolution_scheme
missing_words
mixture
mobile_military_command_and_control
model
model_checking
model_design
model_of_grammatical_processing
model_parameters
model_theoretic_interpretation
modeling
models
modification_probabilities
modified
modify
modular
modular_architecture
module
modules
moment
monolingual dependency parse
monolingual_and_bilingual_information
monolingual_data
monolingual_parallel_corpora
monolingual_target_data
more
morpheme_boundaries
morpheme_sequence
morpho-syntactic "building blocks"
morpho-syntactic_and_semantic_characteristics
morphological_analysis
morphological_analysis_method
morphological_analysis_problem
morphological_analyzer
morphological_and_syntactic_information
morphological_component
morphological_constructions
morphological_structure
morphology
morphosyntactic_content
most
motivated
move-tagged_abstracts
much
much-studied
multi-component_architecture
multi-level_confidence_scores
multi-level_linguistic_knowledge
multi-modal_multi-domain_dialogue_system_-_SmartKom_-
multi-pathway_MT_architecture_design
multi-scale_retrieval
multi-source_and_speech_translation
multi-stage_spoken_language_understanding_(SLU)
multi-strategy_and_multi-source_approach_to_question_answering
multi-strategy_approach
multi-strategy_framework
multi-tagging_approach
multidimensional_chart_parser
multilingual,_multimedia_data
multilingual_TIPSTER_user_interfaces
multilingual_grammar_engineering
multilingual_input
multilingual_speech_and_language_applications
multilingual_translation_system
multilingually_aligned_wordnets
multimedia annotation
multimedia_annotation
multimedia_content
multimedia_summarization
multimodal_document
multimodal_parsing_and_understanding
multinomial_naive_Bayes_classification
multiple
multiple_and_nested_interactions
multiple_complementation_patterns
multiple_layers
multiple_parsing_strategies,
multisentential and multi-paragraph explanations
must
mutual_information
n-ary_relations
n-best_speech/language_integration_architecture
n-gram_overlap
n-gram_semantic_tagger
n-gram_statistics
n-gram_transliteration_model_(n-gram_TM),
named entities
named_entity_(NE)_recognition_(NER)_system
namely
names
naming_conventions
natural language interfaces
natural_language
natural_language_applications
natural_language_documents
natural_language_environment
natural_language_generation
natural_language_generation_community
natural_language_generation_system
natural_language_interface
natural_language_interfaces
natural_language_interpretation
natural_language_processing
natural_language_processing,
natural_language_processing_(NLP)_systems
natural_language_processing_(NLP)_technologies
natural_language_processing_systems
natural_language_processing_tasks
natural_language_questions
natural_language_strings
natural_language_system
natural_language_text
natural_language_understanding
natural_languages
natural_sublanguages
naturally
nature
navigation
neat_texts
necessary
need
needed
needs
network_of_lexical_collocations
neural_network_model
never
new
new_domain
new_event_detection
new_sublanguage
news_articles
newspaper text,
newspaper texts
newspaper_corpus
newswire_domain
newswire_texts
node-based_inference
node_structures
nodes
nominal_compounds
nominal_constituents
nominals
non-English_(Arabic)_stemmer
non-configurational_languages
non-contiguous_phrases
non-literal_aspects_of_communication
non-terminal_symbol
non-terminals
normal
not
noun
noun_WSD_problems
noun_phrase
noun_phrase_chunks
nouns
novel
novel_subword_translation_technique
number
numbers
numerous
objects
observed
obtain
obtained
occur
occurring
of
offer
offers
official_rankings
often
on
on-line_encyclopedias_and_dictionaries
on-line_parser
one
only
onto
ontology-based_query_expansion
ontology-based_querying
open-domain_question_answering
operate
operates
operational_foreign_language_tutoring
operational_semantics
opinionated texts (OIR)
opposed
optimum_iteration_number
or
oral_communication
oral_reading
oral_reading_audio_data
order
ordinary
organized
oriented
origin
original
originally
other
other_grammars
our
out
out-of-domain_corpus
outperform
outperforms
output
outputs
over
overall
overcome
overt_case_markers
own
packed
pages
pair
pairs
paper
paragraphs
parallel corpora
parallel_bi-lingual_data
parallel_concordances
parallel_corpora
parallel_corpus
parallel_data
parallel_structures
paraphrase
paraphrase_class
paraphrase_classification_accuracy
paraphrase_examples
paraphrases
paraphrasing
paraphrasing_method
parse
parse trees
parse-trees
parse_forest
parse_forest_representation
parse_record
parse_reduction
parse_tree
parse_trees
parsed
parsed_corpus
parser
parser_MDCC
parser_for_non-configurational_languages
parses
parsing
parsing-based_NE_rules
parsing_algorithm
parsing_data
parsing_method
parsing_model
parsing_process
parsing_strategies
parsing_system
parsing_technique
part
part-of-speech_annotation
part-of-speech_tagging,
part_of_speech_(pos)_tagging
part_of_speech_information
partial_theories
participated
particular
particularly
parts of speech
passed
passives,
patchy
path_values
pattern
patterns
per
perform
performance
performance_improvement
performed
performing
performs
permit
permits
permitted
personal_computers
personal_names,
pharmaceutical news archive
phone-dependent_cepstral_compensation,
phone-string_classifier
phone_n-gram_model
phoneme_recognition
phonemes
phonetic_recognition
phonological_system
phrasal_patterns
phrase
phrase candidates
phrase translations
phrase-based_models
phrase-based_statistical_machine_translation_method,
phrase-based_translation
phrase-based_unigram_model
phrase-by-phrase_approach
phrase_boundary_heuristics
phrase_chunking
phrase_recognition
phrase_structure_grammar
phrase_translations
phrases
pieces
pilot_study
pipelined_NLG_architecture,
pivot
place
placement
plain_text_corpus
plain_textual_data
plan-based_agenda_mechanism
planning-based_architecture
platform
plays
polarity-tagged_corpus
polarization
polynomial_time
polynomial_time_solution
polysemous_word
polysemy
pooling
portability
ported
portion
pos_tag_ambiguity
positive_and_negative_definition_examples
positive_feature_vectors
possible
possible,
possible_antecedents
post-processing
potential
powerful
practical
practically_unsupervised_learning_method
practice,
pragmatics_processing,
pre-selects
preceding_words
preceeding
precision
precision_rate
precomputes
predicate-argument_structure_information
predicate-argument_structures
predicate_calculus_notation
predicative_information
predictably
predicting
predicting_top-level_boundaries,
prediction_of_MP
prediction_task
predictions
predictive_performance
predictive_questioning
predictor
predominant_senses
preference
prefiltering
premise_and_hypothesis_pairs
presence
present
presented
presented,
presumed
presuppositional_nature
previous
previously
previously-described
primarily
priming
priming_effects
primitive_Optimality_Theory_(OTP),
principle-based_theory
principled
printed_text
prior_knowledge
priors
probabilistic context-free grammars
probabilistic_Horn_clauses
probabilistic_context-free_grammar
probabilistic_context-free_grammar_(PCFG)
probabilistic_context-free_grammars
probabilistic_finite_automata
probabilistic_finite_automaton
probabilistic_model
probabilistic_spectral_mapping
probabilistic_synchronous_dependency_insertion_grammar
probabilistic_translation_models
probabilities
probability-based_scoring_function
probability_estimates
probability_estimation
problem
problem,
problematic
problems
procedural
procedures
process
processes
processing
processing_speed
produce
produced
produces
program
program,
programming_language
projecting
projection_of_structures
prominence
pronominal_anaphora_resolution_module
pronominalization,
pronoun
pronoun_"it"
pronoun_il
pronoun_resolution
pronouns
proof procedure
proof-based_approach
proof-based_representation
proper
proper_names
properties
property
proportion_problem
proposed
proposed_methods
proposition
prosodic
prosodic_morphology
protocol_analysis
prototype
prototype_system
provide
provided
provides
providing
pruning_criteria
psycholinguistic_literature
published
punctuation
purpose
purposes
pushdown_automaton
put
pyramid_evaluation
pyramids
qualitative_spatial_constraints
quality
quantification_over_events
quantified_sentences,
quantifying_noun_groups
quantitative_method
queries
query_optimisation
query_terms
querying_framework
question-answer_pairs
question-answering_NL_systems
question-focused_sentence_retrieval
question/answer_pairs
question_answering
question_phrases
questions
questions,
randomly
range
range_concatenation_grammar_[RCG]_formalism
range_concatenation_languages_[RCL]
rank
rank,
ranking
ranking_algorithm
ranking_learning_problem
ranking_problems
ranking_rules
rankings
ranks
rate
rather
rating
raw_text
reach
reached
read_and_spontaneous_speech
readability
readability_measures
readily
reading_difficulty
reading_miscues
real
real-time_dialog_system
real-valued_features
real-world entities
realistic_text_analysis_tasks
reality
reasonably
reasoning_with_dispositions
recall,
recent
recently
recognition
recognition_and_classification_of_proper_names,_numerical_and_temporal_expressions,_i.e._Named_Entity_(NE)_items
recognition_network
recognition_of_extra-grammatical_input
recognition_technology
recognizer
recognizing
recordings
reduce
reduced
reduced_IL_formulae
reduces
reduction_of_error_rates
reduplication
reduplications
reestimation_formulas
reference
reference_corpora
reference_corpus
reference_model
reference_sets
references
referential_elements
referential_information
referential_properties_of_noun_phrases
referents
referring_expressions
reflect
regarded
regular_expressions
regular_grammar
regular_languages
related
relation extraction
relational_database
relations
relationship
relative
relative clauses
relative_error_rate_reduction
relative_f0_variability
relative_frequency_of_occurrence
relative_informativeness
relatively
relevance
relevant
relevant_Chinese_broadcast_news_stories_(audio)
reliable
reliable_relevancy_cues
relied
relies
rely
relying
remains
replete
report
repository
represent
representation
representation_scheme
representation_tree
representations
represented
representing
represents
require
required
requirements
requires
requiring
research
research_articles
researchers
resemble
resolution_component
resolve
resolves
resolving
resource
resource-conscious_variant_of_automata
resource-frugal_approach
respect
respectively
restricted_natural_language
restricted_subset
restricted_vocabulary
restrictive_statements
result
resulting
results
retrieval
retrieval_approach
retrieval_effectiveness
retrieval_performance
retrieve
retrieves
retrieving
revealed
reversible
revision_component
rhetorical_patterns
rich_features
rich_linguistic_features
richer
right-side dependencies
robust
robust---an
robust_explanation_system
robust_generator
robustness
robustness_problems
role
role-labelling task,
root_word_lexicon
roots_words
rule
rule-based_approach
rule-based_heuristics
rule-based_learning_algorithm,
rule-based_systems
rule-based_translation_systems
rule-invocation_strategies
rules
run
running
runs
runtime,
s-VSM_model
salience
same
satisfactorily
saturation
scenario_templates
scf types
scfs
scholarly_digital_editions
scientific
scope
scope_ambiguity
scoring
scratch
scripts
scruffy_texts
seamless
search
search engine
searched
second_language_and_cognitive_skill_acquisition
sector
seed_sentences
seeds
seem
segment
segment-based_approach
segment_boundaries
segment_order-sensitive_methods
segmentation
segmentation bakeoff
segmentation_standards
segmented_strings
segmenting
segments
select
selected
selecting
self-learning_lemmatizer
self-organizing_semantic_map
semantic
semantic constraints
semantic network
semantic-oriented_NLP_applications
semantic_analyzer
semantic_annotation
semantic_attribute
semantic_attributes
semantic_caseframe_instantiation
semantic_composition
semantic_constraints
semantic_criterion
semantic_distance
semantic_domain_models
semantic_equivalence
semantic_expressibility
semantic_features
semantic_functions
semantic_information
semantic_interpretation
semantic_knowledge
semantic_relatedness
semantic_relations
semantic_representation
semantic_role_labeling
semantic_role_labeling,
semantic_taxonomy
semantic_variables
semantic_verb_classes
semantically_annotated_corpus
semantically_related_words
semantically_rich,_large-scale_knowledge_bases
semantically_unmarked_term
semantics
semantics_directed_approach
semi-automatic_alignment_procedure
semi-automatically_detected_keyframes
semi-supervised_methods
semiautomatic_annotation_scheme
sense
sense-tagged_training_data
sense_assignment
sense_priors
sense_resolution
senses
sentence
sentence-level_and_text-level_anaphora
sentence-level_semantic_equivalence_classification
sentence_analysis
sentence_co-occurrences
sentence_compression
sentence_extraction
sentence_generation_technology
sentence_plan
sentence_plans
sentence_processing
sentence_retrieval_problem,
sentences
sentences,
sentential_paraphrases
sentiment_vector_space_model_(s-VSM)
sequences
sequential_models
sequentially,
series
serve
serves
set
set_of_labels
sets
several
severely
shallow_linguistic_features
shallow_mapping
shallow_semantic_parsing
shallow_syntactic_analysis
shallow_techniques
share
shared_derivation_forest
shared_grammar_of_Slavic
shared_lexical_information
sharing
shift-reduce_dependency_parsers
should
show
showing
shown
shows
sides
significance
significant
